In [2]:
import pandas as pd
import numpy as np

In [3]:
user_data = {
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(1,50,5),
    "MarksC":np.random.randint(1,100,5)
}

In [5]:
user_data

{'MarksA': array([ 3, 33, 50, 95,  4]), 'MarksB': array([10,  8, 28, 39, 27]), 'MarksC': array([74, 99, 30, 55, 18])}

In [11]:
df = pd.DataFrame(user_data, dtype = 'float32')
df

   MarksA  MarksB  MarksC
0     3.0    10.0    74.0
1    33.0     8.0    99.0
2    50.0    28.0    30.0
3    95.0    39.0    55.0
4     4.0    27.0    18.0

In [9]:
df.head(3)

   MarksA  MarksB  MarksC
0       3      10      74
1      33       8      99
2      50      28      30

In [10]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [19]:
#creating a csv file
df.to_csv('marks.csv')

In [20]:
# reading the csv file
my_data = pd.read_csv('marks.csv')
my_data

   Unnamed: 0  MarksA  MarksB  MarksC
0           0     3.0    10.0    74.0
1           1    33.0     8.0    99.0
2           2    50.0    28.0    30.0
3           3    95.0    39.0    55.0
4           4     4.0    27.0    18.0

In [24]:
my_data = my_data.drop(columns=['Unnamed: 0'])
my_data

   MarksA  MarksB  MarksC
0     3.0    10.0    74.0
1    33.0     8.0    99.0
2    50.0    28.0    30.0
3    95.0    39.0    55.0
4     4.0    27.0    18.0

In [25]:
#shows statistical data
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   37.000000  22.400000  55.200000
std    38.059164  13.126309  32.752099
min     3.000000   8.000000  18.000000
25%     4.000000  10.000000  30.000000
50%    33.000000  27.000000  55.000000
75%    50.000000  28.000000  74.000000
max    95.000000  39.000000  99.000000

In [28]:
# row and column
df.iloc[3,1]
# df.iloc[3][1]

39.0

In [30]:
#locate an index
idx = df.columns.get_loc('MarksB')
idx

1

In [33]:
#slicing
df.iloc[:3,idx:]

   MarksB  MarksC
0    10.0    74.0
1     8.0    99.0
2    28.0    30.0

In [32]:
df.iloc[:3,[1,2]]

   MarksB  MarksC
0    10.0    74.0
1     8.0    99.0
2    28.0    30.0

In [34]:
#sorting
my_data.sort_values(by=['MarksA'],ascending=False)

   MarksA  MarksB  MarksC
3    95.0    39.0    55.0
2    50.0    28.0    30.0
1    33.0     8.0    99.0
4     4.0    27.0    18.0
0     3.0    10.0    74.0

In [36]:
data_array = my_data.values
data_array

array([[ 3., 10., 74.],
       [33.,  8., 99.],
       [50., 28., 30.],
       [95., 39., 55.],
       [ 4., 27., 18.]])

In [37]:
# numpy array to dataframe
new_df = pd.DataFrame(data_array,dtype='int32',columns = ['Physics','Chem','Maths'])
new_df

   Physics  Chem  Maths
0        3    10     74
1       33     8     99
2       50    28     30
3       95    39     55
4        4    27     18

In [38]:
new_df.to_csv('PCM.csv', index =False)  #index=False removes that 'unnamed: 0' part from the csv

In [39]:
pcm = pd.read_csv('PCM.csv')
pcm

   Physics  Chem  Maths
0        3    10     74
1       33     8     99
2       50    28     30
3       95    39     55
4        4    27     18